cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx_v9.xml
				</field>
			</fields>
		</register>
		<register>
			<name>LCR</name>
			<description>Line Control Register. Contains controls for frame formatting and break generation.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WLS</name>
					<description>Word Length Select</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>5_BIT_CHARACTER_LENG</name>
							<description>5-bit character length.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>6_BIT_CHARACTER_LENG</name>
							<description>6-bit character length.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>7_BIT_CHARACTER_LENG</name>
							<description>7-bit character length.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>8_BIT_CHARACTER_LENG</name>
							<description>8-bit character length.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SBS</name>
					<description>Stop Bit Select</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_STOP_BIT_</name>
							<description>1 stop bit.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_STOP_BITS</name>
							<description>2 stop bits (1.5 if LCR[1:0]=00).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PE</name>
					<description>Parity Enable</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_PARITY_GENER</name>
							<description>Disable parity generation and checking.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_PARITY_GENERA</name>
							<description>Enable parity generation and checking.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PS</name>
					<description>Parity Select</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ODD_PARITY_NUMBER_O</name>
							<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVEN_PARITY_NUMBER_</name>
							<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FORCED_1_STICK_PARIT</name>
							<description>Forced 1 stick parity.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FORCED_0_STICK_PARIT</name>
							<description>Forced 0 stick parity.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BC</name>
					<description>Break Control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_BREAK_TRANSM</name>
							<description>Disable break transmission.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_BREAK_TRANSMI</name>
							<description>Enable break transmission. Output pin UART TXD is forced to logic 0 when LCR[6] is active high.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DLAB</name>
					<description>Divisor Latch Access Bit</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_ACCESS_TO_DI</name>
							<description>Disable access to Divisor Latches.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_ACCESS_TO_DIV</name>
							<description>Enable access to Divisor Latches.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>MCR</name>
			<description>Modem control register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DTRC</name>
					<description>DTR Control. Source for modem output pin, DTR. This bit reads as 0 when modem loopback mode is active.</description>
					<bitRange>[0:0]</bitRange>

				</field>
				<field>
					<name>RTSC</name>
					<description>RTS Control. Source for modem output pin RTS. This bit reads as 0 when modem loopback mode is active.</description>
					<bitRange>[1:1]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[3:2]</bitRange>

				</field>
				<field>
					<name>LMS</name>
					<description>Loopback Mode Select. The modem loopback mode provides a mechanism to perform diagnostic loopback testing. Serial data from the transmitter is connected internally to serial input of the receiver. Input pin, RXD, has no effect on loopback and output pin, TXD is held in marking state. The four modem inputs (CTS, DSR, RI and  DCD) are disconnected externally. Externally, the modem outputs (RTS, DTR) are set inactive. Internally, the four modem outputs are connected to the four modem inputs. As a result of these connections, the upper four bits of the MSR will be driven by the lower four bits of the MCR rather than the four modem inputs in normal mode. This permits modem status interrupts to be generated in loopback mode by writing the lower four bits of MCR.</description>
					<bitRange>[4:4]</bitRange>

