cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx_v9.xml
				</field>																				
				<field>																				
					<name>EM1</name>																			
					<description>External Match 1. This bit reflects the state of output CT16B0_MAT1/CT16B1_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT16B0_MAT1/CT16B1_MAT1 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>																			
					<bitRange>[1:1]</bitRange>																			
																	
				</field>																				
				<field>																				
					<name>EM2</name>																			
					<description>External Match 2. This bit reflects the state of output match channel 2, whether or not this output is connected to its pin. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output. Note that on counter/timer 0 this match channel is not pinned out. This bit is driven to the CT16B1_MAT2 pin if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>																			
					<bitRange>[2:2]</bitRange>																			
																	
				</field>																				
				<field>																				
					<name>EM3</name>																			
					<description>External Match 3. This bit reflects the state of output of match channel 3. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output. There is no output pin available for this channel on either of the 16-bit timers.</description>																			
					<bitRange>[3:3]</bitRange>																			
																	
				</field>																				
				<field>																				
					<name>EMC0</name>																			
					<description>External Match Control 0. Determines the functionality of External Match 0.</description>																			
					<bitRange>[5:4]</bitRange>																			
					<enumeratedValues>																			
					<name>ENUM</name>																			
						<enumeratedValue>																		
							<name>DONOTHING</name>																	
							<description>Do Nothing.</description>																	
							<value>0x0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>CLEAR</name>																	
							<description>Clear the corresponding External Match bit/output to 0 (CT16Bn_MATm pin is LOW if pinned out).</description>																	
							<value>0x1</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>SET</name>																	
							<description>Set the corresponding External Match bit/output to 1 (CT16Bn_MATm pin is HIGH if pinned out).</description>																	
							<value>0x2</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>TOGGLE</name>																	
							<description>Toggle the corresponding External Match bit/output.</description>																	
							<value>0x3</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>EMC1</name>																			
					<description>External Match Control 1. Determines the functionality of External Match 1.</description>																			
					<bitRange>[7:6]</bitRange>																			
					<enumeratedValues>																			
					<name>ENUM</name>																			
						<enumeratedValue>																		
							<name>DONOTHING</name>																	
							<description>Do Nothing.</description>																	
							<value>0x0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>CLEAR</name>																	
							<description>Clear the corresponding External Match bit/output to 0 (CT16Bn_MATm pin is LOW if pinned out).</description>																	
							<value>0x1</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>SET</name>																	
							<description>Set the corresponding External Match bit/output to 1 (CT16Bn_MATm pin is HIGH if pinned out).</description>																	
							<value>0x2</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>TOGGLE</name>																	
							<description>Toggle the corresponding External Match bit/output.</description>																	
							<value>0x3</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>EMC2</name>																			
					<description>External Match Control 2. Determines the functionality of External Match 2.</description>																			
					<bitRange>[9:8]</bitRange>																			
					<enumeratedValues>																			
					<name>ENUM</name>																			
						<enumeratedValue>																		
							<name>DONOTHING</name>																	
							<description>Do Nothing.</description>																	
							<value>0x0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>CLEAR</name>																	
							<description>Clear the corresponding External Match bit/output to 0 (CT16Bn_MATm pin is LOW if pinned out).</description>																	
							<value>0x1</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>SET</name>																	
							<description>Set the corresponding External Match bit/output to 1 (CT16Bn_MATm pin is HIGH if pinned out).</description>																	
							<value>0x2</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>TOGGLE</name>																	
							<description>Toggle the corresponding External Match bit/output.</description>																	
							<value>0x3</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>EMC3</name>																			
					<description>External Match Control 3. Determines the functionality of External Match 3.</description>																			
					<bitRange>[11:10]</bitRange>																			
					<enumeratedValues>																			
					<name>ENUM</name>																			
						<enumeratedValue>																		
							<name>DONOTHING</name>																	
							<description>Do Nothing.</description>																	
							<value>0x0</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>CLEAR</name>																	
							<description>Clear the corresponding External Match bit/output to 0 (CT16Bn_MATm pin is LOW if pinned out).</description>																	
							<value>0x1</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>SET</name>																	
							<description>Set the corresponding External Match bit/output to 1 (CT16Bn_MATm pin is HIGH if pinned out).</description>																	
							<value>0x2</value>																	
						</enumeratedValue>																		
						<enumeratedValue>																		
							<name>TOGGLE</name>																	
							<description>Toggle the corresponding External Match bit/output.</description>																	
							<value>0x3</value>																	
						</enumeratedValue>																		
					</enumeratedValues>																			
				</field>																				
				<field>																				
					<name>RESERVED</name>																			
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																			
					<bitRange>[31:12]</bitRange>																			
																	
