cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx_v9.xml
				</field>
			</fields>
		</register>
		<register>
			<name>SSEL1_LOC</name>
			<description>SSEL1 pin location select register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSEL1LOC</name>
					<description>Selects pin location for SSEL1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_2</name>
							<description>Selects SSEL1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO2_4</name>
							<description>Selects SSEL1 function in pin location  PIO2_4/CT16B1_MAT1/SSEL1 (see Table 119).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		
		<register>
			<name>SCK1_LOC</name>
			<description>SCK1 pin location select register</description>
			<addressOffset>0x0C4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCK1LOC</name>
					<description>Selects pin location for SCK1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_1</name>
							<description>Selects SCK1 function in pin location PIO2_1/DSR/SCK1 (see Table 113).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_2</name>
							<description>Selects SCK1 function in pin location PIO3_2/DCD/CT16B0_MAT2/SCK1 (see Table 142).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>MISO1_LOC</name>
			<description>MISO1 pin location select register</description>
			<addressOffset>0x0C8</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MISO1LOC</name>
					<description>Selects pin location for the MISO1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_2</name>
							<description>Selects MISO1 function in pin location PIO2_2/DCD/MISO1 (see Table 126).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO1_10</name>
							<description>Selects MISO1 function in pin location PIO1_10/AD6/CT16B1_MAT1/MISO1 (see  Table 130).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>MOSI1_LOC</name>
			<description>MOSI1 pin location select register</description>
			<addressOffset>0x0CC</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MOSI1LOC</name>
					<description>Selects pin location for the MOSI1 function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO2_3</name>
							<description>Selects MOSI1 function in pin location PIO2_3/RI/MOSI1 (see Table 138).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO1_9</name>
							<description>Selects MOSI1 function in pin location PIO1_9/CT16B1_MAT0/MOSI1 (see Table 117).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
				</field>
			</fields>
		</register>
		
		<register>
			<name>RXD_LOC</name>
			<description>RXD pin location select register</description>
			<addressOffset>0x0D4</addressOffset>
			<access>read-write</access>
			<resetValue>0x00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXDLOC</name>
					<description>Selects pin location for the RXD function.</description>
					<bitRange>[1:0]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>PIO1_6</name>
							<description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO2_7</name>
							<description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_1</name>
							<description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PIO3_4</name>
							<description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118).</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
			
