cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx_v9.xml
				</field>
				<field>
					<name>NOTUSED5</name>
					<description>Reserved. Always write these bits as 111.</description>
					<bitRange>[15:13]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>DEVICE_ID</name>
			<description>Device ID register 0 for parts  LPC1100C.</description>
			<addressOffset>0x3F4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DEVICEID</name>
					<description>Part ID numbers  0x1421 102B = LPC11C12/FBD48/301 0x1440 102B = LPC11C14/FBD48/301 0x1431 102B = LPC11C22/FBD48/301 0X1430 102B = LPC11C24/FBD48/301</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
	</peripheral>
  	<peripheral>
	<name>C_CAN</name>
	<description>C_CAN controller </description>
	<groupName>C_CAN</groupName>
	<baseAddress>0x40050000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>C_CAN</name>
	<value>13</value>
	</interrupt>
	<registers>
		<register>
			<name>CANCNTL</name>
			<description>CAN control</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0001</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INIT</name>
					<description>Initialization</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL_OPERATION</name>
							<description>Normal operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INITIALIZATION_IS_ST</name>
							<description>Initialization is started. On reset, software needs to initialize the CAN controller.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IE</name>
					<description>Module interrupt enable</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_CAN_INTERRUP</name>
							<description>Disable CAN interrupts. The interrupt line is always HIGH.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_CAN_INTERRUPT</name>
							<description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SIE</name>
					<description>Status change interrupt enable</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_STATUS_CHANG</name>
							<description>Disable status change interrupts. No status change interrupt will be generated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_STATUS_CHANGE</name>
							<description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EIE</name>
					<description>Error interrupt enable</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_ERROR_INTERR</name>
							<description>Disable error interrupt. No error status interrupt will be generated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_ERROR_INTERRU</name>
							<description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[4:4]</bitRange>

				</field>
				<field>
					<name>DAR</name>
					<description>Disable automatic retransmission</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>AUTOMATIC_RETRANSMIS</name>
							<description>Automatic retransmission of disturbed messages enabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUTOMATIC_RETRANSMIS</name>
							<description>Automatic retransmission disabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CCE</name>
					<description>Configuration change enable</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_CPU_HAS_NO_WRITE</name>
							<description>The CPU has no write access to the bit timing register.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_CPU_HAS_WRITE_AC</name>
							<description>The CPU has write access to the CANBT register while the INIT bit is one.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENUM</name>
					<description>Test mode enable</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL_OPERATION</name>
							<description>Normal operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEST_MODE</name>
							<description>Test mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[31:8]</bitRange>

